[
    {
        "name": "Middle backend Python",
        "link": "https://krasnodar.hh.ru/vacancy/100104200?query=python&hhtmFrom=vacancy_search_list",
        "company": "ООО РА Дельта",
        "salary": "до 150 000 ₽ на руки",
        "city": "Москва",
        "description": "В нашу компанию требуется хороший человек - и при этом Python-разработчик:)  Наш профиль - это in-house разработка массовых онлайн-сервисов и софтов, а также инструментов для рынка интернет-рекламы. Мы занимаем лидирующие позиции на рынке дистрибуции софта в странах СНГ. Эта вакансия для человека с опытом - крепкого python middle'а, который хочет двигаться в сторону python senior'а. Широкая вилка оклада обусловлена тем, что на задачи в текущих проектах требуется несколько разработчиков - и мы готовы рассматривать кандидатов разного уровня. Кратко. Python, full-time, гибкий график, удалённая работа. Гарантируем крутой рабочий процесс, помощь в освоении нового, интересные задачи и, конечно, достойную оплату. Необходимые навыки:   уверенно владеть Python 3, понимать отличия от Python 2;   иметь опыт работы с FastAPI (с использованием асинхронности) и Django (с DRF) в production;   опыт работы в production с базами MongoDB, MySQL, Redis;   опыт работы с Git и понимание Gitflow;   уметь разбираться в чужом коде.   Будет плюсом:   навык написания тестов с использованием unittest/pytest, mock;   опыт работы с Prometheus и построения дашбордов на Grafana;   продвинутые навыки использования MySQL и/или MongoDB (индексы, транзакции и уровни их изоляции, шардинг и т.д.);   опыт CI для Python приложений (Docker + Gitlab);   понимание особенностей микросервисной архитектуры и опыт решения проблем микросервисного взаимодействия;   опыт работы с RabbitMQ или другими брокерами сообщений   Особо отметим опыт работы с различными объектами Kubernetes и написания Helm-чартов для деплоя приложений в него. Условия:  Конкурентный уровень дохода, при full-time. Определяется вашими начальными навыками.  Премии за успешное выполнение стратегически важных этапов.   Удалённая работа. Гибкий график. Вы сможете разбить свой день на удобные интервалы работы и работать в привычной обстановке.   Работа над проектами внутри мини-команд: опытные напарники JS и Node.js, системный администратор, тимлид. Забудьте о соло-разработке, девопсе своими руками и бюрократии:)   Современные процессы разработки (Docker + Kubernetes, CI/CD + GitOps), востребованные и качественно реализованные проекты.   Классная команда - мы умеем и любим работать с людьми. Гарантируем “правильный” менеджмент и прокачку недостающих компетенций. У нас выверенный годами баланс между дисциплиной и свободой.   Возможность развития до разработчика fullstack'а или senior'а.     Дополнительные инструкции: Мы будем признательны, если к отклику вы приложите:   небольшой рассказ о себе в свободной форме: напишите об интересах в программировании (или работе в целом) и о том, что зацепило в нашей вакансии;   примеры своего кода: GitHub, Bitbucket, ссылка на облако или как-то иначе.  "
    }
]